Основные_объекты_Занятие_5/src/DataProcessors/ЗаменаРодителя/ЗаменаРодителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаменаРодителя</name>
  <attributes>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Основные_объекты_Занятие_5/src/DataProcessors/ЗаменаРодителя/Forms/Форма/Module.bsl
&НаКлиенте
Процедура НайтиСотрудникаПоКоду(Команда)

	СерверныйСВызовом.НайтиСотрудникаПоКоду(Объект.Код, Объект.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиРодителяПоИмени(Команда)

	СерверныйСВызовом.НайтиРодителяПоИмени(Объект.ИмяРодителя, Объект.Родитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьРодителя(Команда)

	СерверныйСВызовом.ЗаменитьРодителя(Объект.Сотрудник, Объект.Родитель);
	
КонецПроцедуры
